[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
-1
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
110
111
112
113
114
115
116
117
118
119
120
121
122
123
124
125
126
127
128
129
130
131
132
133
134
135
136
137
138
139
140
141
142
143
144
145
146
147
148
149
150
151
152
153
154
155
156
157
158
159
160
161
162
163
164
165
166
167
168
169
170
171
172
173
174
175
176
177
178
179
180
181
182
183
184
185
186
187
188
189
190
191
192
193
194
195
196
197
198
199
200
201
202
203
204
205
206
207
208
209
210
211
212
213
214
215
216
217
218
219
220
221
222
223
224
225
226
227
228
229
230
231
232
233
234
235
236
237
238
239
240
241
242
243
244
245
246
247
248
249
250
251
252
253
254
255
256
257
258
259
260
261
262
263
264
265
266
267
268
269
270
271
272
273
274
275
276
277
278
279
280
281
282
283
284
285
286
287
288
289
290
291
292
293
294
295
296
297
298
299
300
301
302
303
304
305
306
307
308
309
310
311
312
313
314
315
316
317
318
319
320
321
322
323
324
325
326
327
328
329
330
331
332
333
334
335
336
337
338
339
340
341
342
343
344
345
346
347
348
349
350
351
352
353
354
355
356
357
358
359
360
361
362
363
364
365
366
367
368
369
370
371
372
373
374
375
376
377
378
379
380
381
382
383
384
385
386
387
388
389
390
391
392
393
394
395
396
397
398
399
400
401
402
403
404
405
406
407
408
409
410
411
412
413
414
415
416
417
418
419
420
421
422
423
424
425
426
427
428
429
430
431
432
433
434
435
436
437
438
439
440
441
442
443
444
445
446
447
448
449
450
451
452
453
454
455
456
457
458
459
460
461
462
463
464
465
466
467
468
469
470
471
472
473
474
475
476
477
478
479
480
481
482
483
484
485
486
487
488
489
490
491
492
493
494
495
496
497
498
499
500
501
502
503
504
505
506
507
508
509
510
511
512
513
514
515
516
517
518
519
520
521
522
523
524
525
526
527
528
529
530
531
532
533
534
535
536
537
538
539
540
541
542
543
544
545
546
547
548
549
550
551
552
553
554
555
556
557
558
559
560
561
562
563
564
565
566
567
568
569
570
571
572
573
574
575
576
577
578
579
580
581
582
583
584
585
586
587
588
589
590
591
592
593
594
595
596
597
598
599
600
601
602
603
604
605
606
607
608
609
610
611
612
613
614
615
616
617
618
619
620
621
622
623
624
625
626
627
628
629
630
631
632
633
634
635
636
637
638
639
640
641
642
643
644
645
646
647
648
649
650
651
652
653
654
655
656
657
658
659
660
661
662
663
664
665
666
667
668
669
670
671
672
673
674
675
676
677
678
679
680
681
682
683
684
685
686
687
688
689
690
691
692
693
694
695
696
697
698
699
700
701
702
703
704
705
706
707
708
709
710
711
712
713
714
715
716
717
718
719
720
721
722
723
724
725
726
727
728
729
730
731
732
733
734
735
736
737
738
739
740
741
742
743
744
745
746
747
748
749
750
751
752
753
754
755
756
757
758
759
760
761
762
763
764
765
766
767
768
769
770
771
772
773
774
775
776
777
778
779
780
781
782
783
784
785
786
787
788
789
790
791
792
793
794
795
796
797
798
799
800
801
802
803
804
805
806
807
808
809
810
811
812
813
814
815
816
817
818
819
820
821
822
823
824
825
826
827
828
829
830
831
832
833
834
835
836
837
838
839
840
841
842
_<APIcall>_abort
_<APIcall>_abs
_<APIcall>_acos
_<APIcall>_append
_<APIcall>_asin
_<APIcall>_assert
_<APIcall>_assign
_<APIcall>_at
_<APIcall>_atan
_<APIcall>_atan2
_<APIcall>_atof
_<APIcall>_atoi
_<APIcall>_atol
_<APIcall>_back
_<APIcall>_bad
_<APIcall>_begin
_<APIcall>_bsearch
_<APIcall>_c_str
_<APIcall>_calloc
_<APIcall>_ceil
_<APIcall>_cin
_<APIcall>_clear
_<APIcall>_clock
_<APIcall>_close
_<APIcall>_compare
_<APIcall>_copy
_<APIcall>_cos
_<APIcall>_count
_<APIcall>_cout
_<APIcall>_data
_<APIcall>_div
_<APIcall>_empty
_<APIcall>_end
_<APIcall>_eof
_<APIcall>_erase
_<APIcall>_exit
_<APIcall>_exp
_<APIcall>_fabs
_<APIcall>_fail
_<APIcall>_fclose
_<APIcall>_feof
_<APIcall>_fflush
_<APIcall>_fgetc
_<APIcall>_fgets
_<APIcall>_fill
_<APIcall>_find
_<APIcall>_find_first_not_of
_<APIcall>_find_first_of
_<APIcall>_find_last_of
_<APIcall>_first
_<APIcall>_fixed
_<APIcall>_flags
_<APIcall>_flip
_<APIcall>_floor
_<APIcall>_flush
_<APIcall>_fmod
_<APIcall>_fopen
_<APIcall>_fputs
_<APIcall>_fread
_<APIcall>_free
_<APIcall>_freopen
_<APIcall>_front
_<APIcall>_fwrite
_<APIcall>_get
_<APIcall>_getc
_<APIcall>_getch
_<APIcall>_getchar
_<APIcall>_getline
_<APIcall>_gets
_<APIcall>_good
_<APIcall>_ignore
_<APIcall>_imag
_<APIcall>_insert
_<APIcall>_is_open
_<APIcall>_isalnum
_<APIcall>_isalpha
_<APIcall>_isdigit
_<APIcall>_islower
_<APIcall>_isprint
_<APIcall>_ispunct
_<APIcall>_isspace
_<APIcall>_isupper
_<APIcall>_itoa
_<APIcall>_key_comp
_<APIcall>_labs
_<APIcall>_length
_<APIcall>_log
_<APIcall>_log10
_<APIcall>_lower_bound
_<APIcall>_main
_<APIcall>_malloc
_<APIcall>_memcmp
_<APIcall>_memcpy
_<APIcall>_memmove
_<APIcall>_memset
_<APIcall>_modf
_<APIcall>_npos
_<APIcall>_open
_<APIcall>_peek
_<APIcall>_pop
_<APIcall>_pop_back
_<APIcall>_pop_front
_<APIcall>_pow
_<APIcall>_precision
_<APIcall>_printf
_<APIcall>_push
_<APIcall>_push_back
_<APIcall>_push_front
_<APIcall>_put
_<APIcall>_putback
_<APIcall>_putchar
_<APIcall>_puts
_<APIcall>_qsort
_<APIcall>_quot
_<APIcall>_raise
_<APIcall>_rand
_<APIcall>_rbegin
_<APIcall>_read
_<APIcall>_real
_<APIcall>_rem
_<APIcall>_remove
_<APIcall>_rend
_<APIcall>_replace
_<APIcall>_reserve
_<APIcall>_reset
_<APIcall>_resize
_<APIcall>_reverse
_<APIcall>_rewind
_<APIcall>_rfind
_<APIcall>_scanf
_<APIcall>_second
_<APIcall>_set
_<APIcall>_setf
_<APIcall>_setlocale
_<APIcall>_signal
_<APIcall>_sin
_<APIcall>_size
_<APIcall>_sort
_<APIcall>_sqrt
_<APIcall>_srand
_<APIcall>_str
_<APIcall>_strcat
_<APIcall>_strchr
_<APIcall>_strcmp
_<APIcall>_strcpy
_<APIcall>_strcspn
_<APIcall>_strftime
_<APIcall>_strlen
_<APIcall>_strncat
_<APIcall>_strncmp
_<APIcall>_strncpy
_<APIcall>_strpbrk
_<APIcall>_strrchr
_<APIcall>_strstr
_<APIcall>_strtok
_<APIcall>_strtol
_<APIcall>_substr
_<APIcall>_sum
_<APIcall>_swap
_<APIcall>_sync
_<APIcall>_system
_<APIcall>_tan
_<APIcall>_time
_<APIcall>_tm_mon
_<APIcall>_to_string
_<APIcall>_to_ulong
_<APIcall>_tolower
_<APIcall>_top
_<APIcall>_toupper
_<APIcall>_unique
_<APIcall>_upper_bound
_<APIcall>_what
_<char>_
_<char_continue>_
_<directive>_#Black
_<directive>_#Color
_<directive>_#abcdefghijklmnopqrstuvwxyz
_<directive>_#define
_<directive>_#include
_<id>_10@
_<id>_11@
_<id>_12@
_<id>_13@
_<id>_14@
_<id>_15@
_<id>_16@
_<id>_17@
_<id>_18@
_<id>_19@
_<id>_1@
_<id>_20@
_<id>_21@
_<id>_22@
_<id>_23@
_<id>_24@
_<id>_25@
_<id>_26@
_<id>_27@
_<id>_28@
_<id>_29@
_<id>_2@
_<id>_30@
_<id>_31@
_<id>_32@
_<id>_33@
_<id>_34@
_<id>_35@
_<id>_36@
_<id>_37@
_<id>_38@
_<id>_39@
_<id>_3@
_<id>_40@
_<id>_41@
_<id>_42@
_<id>_43@
_<id>_44@
_<id>_45@
_<id>_46@
_<id>_47@
_<id>_48@
_<id>_49@
_<id>_4@
_<id>_50@
_<id>_51@
_<id>_52@
_<id>_53@
_<id>_54@
_<id>_55@
_<id>_56@
_<id>_57@
_<id>_58@
_<id>_59@
_<id>_5@
_<id>_60@
_<id>_61@
_<id>_62@
_<id>_63@
_<id>_6@
_<id>_7@
_<id>_8@
_<id>_9@
_<include>_<ctype.h>
_<include>_<limits.h>
_<include>_<math.h>
_<include>_<stdio.h>
_<include>_<stdlib.h>
_<include>_<string.h>
_<include>_<strings.h>
_<insertion>_
_<keyword>_EOF
_<keyword>_NULL
_<keyword>_and
_<keyword>_asm
_<keyword>_break
_<keyword>_case
_<keyword>_catch
_<keyword>_class
_<keyword>_const
_<keyword>_continue
_<keyword>_default
_<keyword>_do
_<keyword>_else
_<keyword>_endl
_<keyword>_enum
_<keyword>_false
_<keyword>_for
_<keyword>_goto
_<keyword>_if
_<keyword>_inline
_<keyword>_module
_<keyword>_namespace
_<keyword>_new
_<keyword>_not
_<keyword>_null
_<keyword>_operator
_<keyword>_or
_<keyword>_public
_<keyword>_register
_<keyword>_reinterpret_cast
_<keyword>_requires
_<keyword>_return
_<keyword>_signed
_<keyword>_sizeof
_<keyword>_static
_<keyword>_static_cast
_<keyword>_struct
_<keyword>_switch
_<keyword>_template
_<keyword>_this
_<keyword>_throw
_<keyword>_true
_<keyword>_try
_<keyword>_typedef
_<keyword>_typename
_<keyword>_using
_<keyword>_void
_<keyword>_while
_<keyword>_xor
_<number>_#
_<number>_0#
_<number>_1#
_<number>_10#
_<number>_11#
_<number>_12#
_<number>_13#
_<number>_14#
_<number>_15#
_<number>_16#
_<number>_17#
_<number>_18#
_<number>_19#
_<number>_2#
_<number>_20#
_<number>_21#
_<number>_22#
_<number>_23#
_<number>_24#
_<number>_25#
_<number>_26#
_<number>_27#
_<number>_28#
_<number>_29#
_<number>_3#
_<number>_30#
_<number>_31#
_<number>_32#
_<number>_33#
_<number>_34#
_<number>_35#
_<number>_36#
_<number>_37#
_<number>_38#
_<number>_39#
_<number>_4#
_<number>_40#
_<number>_41#
_<number>_42#
_<number>_43#
_<number>_44#
_<number>_45#
_<number>_46#
_<number>_47#
_<number>_48#
_<number>_49#
_<number>_5#
_<number>_50#
_<number>_51#
_<number>_52#
_<number>_53#
_<number>_54#
_<number>_55#
_<number>_56#
_<number>_57#
_<number>_58#
_<number>_59#
_<number>_6#
_<number>_60#
_<number>_61#
_<number>_62#
_<number>_63#
_<number>_7#
_<number>_8#
_<number>_9#
_<op>_!
_<op>_!=
_<op>_#
_<op>_%
_<op>_%=
_<op>_&
_<op>_&&
_<op>_&=
_<op>_(
_<op>_)
_<op>_*
_<op>_**
_<op>_*=
_<op>_+
_<op>_++
_<op>_+=
_<op>_,
_<op>_-
_<op>_--
_<op>_-=
_<op>_->
_<op>_.
_<op>_/
_<op>_/=
_<op>_:
_<op>_;
_<op>_<
_<op>_<<
_<op>_<=
_<op>_=
_<op>_==
_<op>_>
_<op>_>=
_<op>_>>
_<op>_?
_<op>_TiLddE
_<op>_[
_<op>_]
_<op>_^
_<op>_{
_<op>_|
_<op>_|=
_<op>_||
_<op>_}
_<string>_
_<string_continue>_
_<type>_bool
_<type>_char
_<type>_double
_<type>_float
_<type>_int
_<type>_long
_<type>_short
_<type>_signed
_<type>_string
_<type>_unsigned
_<type>_wchar_t
